#!/usr/bin/php
<?php

require_once '/var/www/TaskExercises/vendor/autoload.php';

/*

Найти количество различных (уникальных) элементов в массиве целых чисел

*/

$n = 10; // размер массива

$min = 1;   // мин.  значение для инициализации массива
$max = 10; // макс. значение для инициализации массива

randInit();

$a = [];

// заполним массив случайными числами
for ($i = 0; $i < $n; $i++) {
    $a[] = mt_rand($min, $max);
}

////////////////////////////////////////////////////////////////////////////////

$set  = []; // храним флаги повторов
$uniq = $n; // количество уникальных элементов; сначала считаем все элементы уникальными

for ($i = 0; $i < $n; $i++) {

    if (!isset($set[$a[$i]])) {
        $set[$a[$i]] = true;
    } else {
        $uniq--;
    }
}

$test = count(array_unique($a, SORT_NUMERIC));

prLog('['. implode(', ', $a) .']');
prLog("uniq = {$uniq}, проверка = ". $test);
